#!/usr/bin/python
# -*- coding: utf-8 -*-
"""
-------------------------------------------------
   File Name：     18-1-理解参数
   Description :
   Author :      'Sam Yong'
   date：          2018/7/10
-------------------------------------------------
   Change Activity:
                   2018/7/10:
-------------------------------------------------
"""
__author__ = 'Sam Yong'

def f(a):
    a = 99

b = 88
f(b)
print(b) # 由于只是传递引用，b 是数字，是不可变对象，因此在函数内部并没有改变实际b的内容，b的值还是88

def f1(a):
    a[0] = 99

b = [1,2,3]
f1(b)
print(b) # 如果是传的可变对象，就会发生改变。可变对象存在共享引用

